
-- ****************************************************************************************************
-- Послеждовательный алгоритм всего
-- ****************************************************************************************************
Use DNA_HLA
Go

-- ****************************************************************************************************
-- Экзоны
-- ****************************************************************************************************
    -- Прочитать файл XLA
    exec hla_XML_read @file_name='C:\WORK\NGS\DATA\hla.xml\hla.xml'
    Go

    -- Разбить на части, сделать хэш
    exec [hla_Hash_create]
    Go
 
    DBCC SHRINKFILE (N'DNA_HLA_log' , 0, TRUNCATEONLY)
    GO
